{"pageProps":{"id":10,"nome":"Instalação do Windows","descricao":"Este manual fornece instruções passo a passo para realizar a instalação do sistema operacional Windows em um computador.","passo_a_passo":[{"passo":1,"titulo":"Preparar o Pen Drive de Boot","descricao":"1. Faça o download da ferramenta de criação de mídia no site oficial da Microsoft (https://www.microsoft.com/software-download/windows). \n2. Execute a ferramenta e selecione 'Criar mídia de instalação'. \n3. Escolha o idioma, a edição e a arquitetura desejados. \n4. Conecte um pen drive (mínimo 8 GB) e siga as instruções para criar o pen drive de boot.","imagem":"/assets/img/windows_instalacao/step1.png"},{"passo":2,"titulo":"Iniciar o Computador com o Pen Drive","descricao":"1. Insira o pen drive de boot no computador. \n2. Reinicie o computador e entre no menu de boot (geralmente pressionando F12, F2, ou ESC). \n3. Selecione o pen drive como dispositivo de inicialização.","imagem":"/assets/img/windows_instalacao/step2.png"},{"passo":3,"titulo":"Configurar o Idioma e Formato de Teclado","descricao":"Na tela de instalação do Windows, escolha o idioma, o formato de hora e moeda e o layout do teclado. Clique em 'Avançar' e depois em 'Instalar agora'.","imagem":"/assets/img/windows_instalacao/step3.png"},{"passo":4,"titulo":"Escolher a Versão do Windows","descricao":"Se solicitado, selecione a versão do Windows que deseja instalar (Home, Pro, etc.) e clique em 'Avançar'.","imagem":"/assets/img/windows_instalacao/step4.png"},{"passo":5,"titulo":"Escolher o Tipo de Instalação","descricao":"Escolha entre 'Atualização' para manter arquivos e configurações ou 'Personalizada' para uma instalação limpa. Para uma instalação limpa, selecione o disco onde deseja instalar o Windows e clique em 'Avançar'.","imagem":"/assets/img/windows_instalacao/step5.png"},{"passo":6,"titulo":"Aguardar a Instalação","descricao":"Aguarde enquanto o Windows é instalado. O computador será reiniciado automaticamente várias vezes durante o processo.","imagem":"/assets/img/windows_instalacao/step6.png"},{"passo":7,"titulo":"Configurar o Sistema","descricao":"Após a instalação, configure a conta de usuário, idioma, fuso horário e outras preferências. Siga as instruções na tela até chegar à área de trabalho.","imagem":"/assets/img/windows_instalacao/step7.png"}]},"__N_SSG":true}