{"pageProps":{"id":9,"nome":"Instalação e Configuração do DBeaver","descricao":"Este manual contém as instruções para instalar e configurar o DBeaver, uma ferramenta de gerenciamento de banco de dados multiplataforma.","passo_a_passo":[{"passo":1,"titulo":"Baixar o Instalador do DBeaver","descricao":"Acesse o site oficial do DBeaver (https://dbeaver.io/) e baixe a versão Community ou Enterprise, conforme sua necessidade. Certifique-se de escolher a versão compatível com o seu sistema operacional (Windows, macOS ou Linux).","imagem":"/assets/img/dbeaver/step1.png"},{"passo":2,"titulo":"Executar o Instalador","descricao":"Localize o arquivo baixado no seu computador e execute-o. Na janela de instalação, aceite os termos de licença clicando em 'I Agree'.","imagem":"/assets/img/dbeaver/step2.png"},{"passo":3,"titulo":"Selecionar Componentes de Instalação","descricao":"Escolha os componentes adicionais que deseja instalar, como ícones no desktop ou suporte a Java. Em seguida, clique em 'Next'.","imagem":"/assets/img/dbeaver/step3.png"},{"passo":4,"titulo":"Escolher Local de Instalação","descricao":"Selecione a pasta onde o DBeaver será instalado ou mantenha o local padrão sugerido. Clique em 'Install' para iniciar a instalação.","imagem":"/assets/img/dbeaver/step4.png"},{"passo":5,"titulo":"Aguardar a Instalação","descricao":"Aguarde enquanto o instalador configura o DBeaver no seu sistema. Esse processo pode levar alguns minutos.","imagem":"/assets/img/dbeaver/step5.png"},{"passo":6,"titulo":"Concluir a Instalação","descricao":"Após o término da instalação, clique em 'Finish' para concluir. Caso queira, marque a opção para abrir o DBeaver automaticamente.","imagem":"/assets/img/dbeaver/step6.png"},{"passo":7,"titulo":"Adicionar uma Conexão de Banco de Dados","descricao":"1. Abra o DBeaver. \n2. Clique em 'New Database Connection' no menu superior ou no painel esquerdo. \n3. Escolha o tipo de banco de dados (MySQL, PostgreSQL, etc.) e clique em 'Next'. \n4. Insira os detalhes de conexão, como host, porta, usuário e senha. \n5. Clique em 'Finish' para salvar a conexão.","imagem":"/assets/img/dbeaver/step7.png"},{"passo":8,"titulo":"Testar a Conexão","descricao":"Após configurar a conexão, clique em 'Test Connection' para garantir que os parâmetros estão corretos. Caso o teste seja bem-sucedido, você estará pronto para usar o DBeaver.","imagem":"/assets/img/dbeaver/step8.png"}]},"__N_SSG":true}